I am going to be prioritising churn datasets which are associated with the telecom industry in this project.
The initial step for this project is to set up our database and a table inside that database, from which we are going to be using data from, for our model.
However, for this the most important factors need to be identified in relation to churn.

While scanning different datasets, the most important factors or rather the factors which are likely to impact churn outcome was determined to be relationship status,dependents,tenure,phone service,online security,tech support,Monthly charges and age

In [32]:
import pandas as pd
import sqlite3
import numpy as np

The process is to ETL(Extract-read the datasets,Transform-Convert to an appropriate format,Load- upload to a centralized sqlite database) the 3 different sources into a predefined sqlite table.

In [33]:
dataset1=pd.read_csv(r"C:\Users\kaile\Project2 files\Telco_customer_churn.csv\Telco_customer_churn.csv")
dataset2=pd.read_csv(r"C:\Users\kaile\Project2 files\telecom_customer_churn.csv\telecom_customer_churn.csv")
dataset3=pd.read_csv(r"C:\Users\kaile\Project2 files\train.csv")

Dataset 1

In [3]:
dataset1.head(5)
dataset1.columns

Index(['CustomerID', 'Count', 'Country', 'State', 'City', 'Zip Code',
       'Lat Long', 'Latitude', 'Longitude', 'Gender', 'Senior Citizen',
       'Partner', 'Dependents', 'Tenure Months', 'Phone Service',
       'Multiple Lines', 'Internet Service', 'Online Security',
       'Online Backup', 'Device Protection', 'Tech Support', 'Streaming TV',
       'Streaming Movies', 'Contract', 'Paperless Billing', 'Payment Method',
       'Monthly Charges', 'Total Charges', 'Churn Label', 'Churn Value',
       'Churn Score', 'CLTV', 'Churn Reason'],
      dtype='object')

In [4]:
dataset1=dataset1[['Partner','Dependents',"Tenure Months","Phone Service","Online Security","Tech Support","Monthly Charges","Senior Citizen","Churn Label"]]

In [5]:
conn = sqlite3.connect("customer_churn.db")
cursor=conn.cursor()

In [6]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS customers (
    Partner TEXT,
    Dependents TEXT,
    Tenure_Months INTEGER,
    Phone_Service TEXT,
    Online_Security TEXT,
    Tech_Support TEXT,
    Monthly_Charges REAL,
    Senior_Citizen TEXT,
    Churn TEXT
)
""")

EDA

The purpose of this EDA is to transform the datasets into suitable formats for upload. We will not look at the quality of the datasets here.

In [34]:
dataset1 = dataset1[dataset1["Online Security"].isin(['Yes', 'No']) &
                   dataset1["Tech Support"].isin(['Yes', 'No'])]

In [35]:
dataset2.columns

Index(['Customer ID', 'Gender', 'Age', 'Married', 'Number of Dependents',
       'City', 'Zip Code', 'Latitude', 'Longitude', 'Number of Referrals',
       'Tenure in Months', 'Offer', 'Phone Service',
       'Avg Monthly Long Distance Charges', 'Multiple Lines',
       'Internet Service', 'Internet Type', 'Avg Monthly GB Download',
       'Online Security', 'Online Backup', 'Device Protection Plan',
       'Premium Tech Support', 'Streaming TV', 'Streaming Movies',
       'Streaming Music', 'Unlimited Data', 'Contract', 'Paperless Billing',
       'Payment Method', 'Monthly Charge', 'Total Charges', 'Total Refunds',
       'Total Extra Data Charges', 'Total Long Distance Charges',
       'Total Revenue', 'Customer Status', 'Churn Category', 'Churn Reason'],
      dtype='object')

In [36]:
dataset2=dataset2[['Married',"Number of Dependents","Tenure in Months","Phone Service","Online Security","Premium Tech Support","Monthly Charge","Age","Churn Category"]]

In [37]:
dataset2.sample(5)

,Married,Number of Dependents,Tenure in Months,Phone Service,Online Security,Premium Tech Support,Monthly Charge,Age,Churn Category
647,No,0,52,No,No,No,30.10,42,NaN
102,Yes,3,62,Yes,Yes,Yes,108.15,42,NaN
6473,Yes,0,44,Yes,No,Yes,104.15,75,NaN
2621,Yes,0,6,Yes,No,No,82.85,34,Competitor
3615,No,0,25,Yes,Yes,Yes,105.50,27,NaN

In [38]:
dataset2 = dataset2[dataset2["Online Security"].isin(['Yes', 'No']) &
                   dataset2["Premium Tech Support"].isin(['Yes', 'No'])]

In [39]:
dataset2["Senior Citizen"]=np.where(dataset2['Age']>65,'Yes','No')
dataset2["Churn"]=np.where(dataset2["Churn Category"].isna(),'No','Yes')
dataset2["Dependents"]=np.where(dataset2["Number of Dependents"]>0,'Yes','No')

In [40]:
dataset2=dataset2[['Married',"Dependents","Tenure in Months","Phone Service","Online Security","Premium Tech Support","Monthly Charge","Senior Citizen","Churn"]]
dataset2.sample(5)

,Married,Dependents,Tenure in Months,Phone Service,Online Security,Premium Tech Support,Monthly Charge,Senior Citizen,Churn
6861,Yes,Yes,52,No,Yes,No,-3.00,No,No
5067,No,No,46,Yes,No,No,72.80,No,No
2142,Yes,Yes,3,Yes,Yes,No,89.85,No,No
4733,No,No,56,Yes,No,Yes,111.95,Yes,Yes
2012,Yes,Yes,1,Yes,No,No,44.55,No,No

In [41]:
dataset3.columns

Index(['Age', 'Avg Monthly GB Download', 'Avg Monthly Long Distance Charges',
       'Churn Category', 'Churn Reason', 'Churn Score', 'City', 'CLTV',
       'Contract', 'Country', 'Customer ID', 'Customer Status', 'Dependents',
       'Device Protection Plan', 'Gender', 'Internet Service', 'Internet Type',
       'Lat Long', 'Latitude', 'Longitude', 'Married', 'Monthly Charge',
       'Multiple Lines', 'Number of Dependents', 'Number of Referrals',
       'Offer', 'Online Backup', 'Online Security', 'Paperless Billing',
       'Partner', 'Payment Method', 'Phone Service', 'Population',
       'Premium Tech Support', 'Quarter', 'Referred a Friend',
       'Satisfaction Score', 'Senior Citizen', 'State', 'Streaming Movies',
       'Streaming Music', 'Streaming TV', 'Tenure in Months', 'Total Charges',
       'Total Extra Data Charges', 'Total Long Distance Charges',
       'Total Refunds', 'Total Revenue', 'Under 30', 'Unlimited Data',
       'Zip Code', 'Churn'],
      dtype='object')

In [42]:
dataset3=dataset3[["Partner","Number of Dependents","Tenure in Months","Phone Service","Online Security","Premium Tech Support","Monthly Charge","Senior Citizen","Churn"]]
dataset3.sample(5)

,Partner,Number of Dependents,Tenure in Months,Phone Service,Online Security,Premium Tech Support,Monthly Charge,Senior Citizen,Churn
2429,1,3,8,1,0,0,94.75,0,0
282,1,1,1,1,0,0,74.60,0,0
1327,1,1,72,1,0,0,20.30,0,0
2191,0,0,30,1,0,1,85.15,0,1
1538,1,0,66,1,0,1,63.85,0,0

In [43]:
dataset3["Partner"]=np.where(dataset3["Partner"]==0,'No','Yes')
dataset3["Dependents"]=np.where(dataset3["Number of Dependents"]>0,'Yes','No')
dataset3["Phone Service"]=np.where(dataset3["Phone Service"]==0,'No','Yes')
dataset3["Online Security"]=np.where(dataset3["Online Security"]==0,'No','Yes')
dataset3["Premium Tech Support"]=np.where(dataset3["Premium Tech Support"]==0,'No','Yes')
dataset3["Senior Citizen"]=np.where(dataset3["Senior Citizen"]==0,'No','Yes')
dataset3["Churn"]=np.where(dataset3["Churn"]==0,'No','Yes')
dataset3=dataset3[["Partner","Dependents","Tenure in Months","Phone Service","Online Security","Premium Tech Support","Monthly Charge","Senior Citizen","Churn"]]

In [46]:
dataset3.sample(5)

,Partner,Dependents,Tenure in Months,Phone Service,Online Security,Premium Tech Support,Monthly Charge,Senior Citizen,Churn
3729,No,Yes,55,Yes,No,No,19.10,No,No
576,Yes,Yes,72,Yes,Yes,Yes,114.00,No,No
1925,No,No,22,Yes,No,No,25.25,No,No
1735,Yes,No,72,Yes,No,No,75.40,No,No
231,No,Yes,17,Yes,Yes,No,50.30,No,No

In [49]:
cursor.execute("""
Select * from customers
""")
cursor.fetchall()

[]

We now need to insert the datasets into a central table in the database.

In [56]:
combined = pd.concat([dataset1, dataset2, dataset3], ignore_index=True)
combined.to_sql("customers", conn, if_exists="replace", index=False)

15259